УТ_для_edt/src/InformationRegisters/CRM_ЖурналДокументов/CRM_ЖурналДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ЖурналДокументов</name>
  <resources>
    <name>ТипОбъекта</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CRM_ОбъектыЖурналаДокументов</types>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </resources>
  <resources>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </resources>
  <resources>
    <name>ВходящееИсходящее</name>
    <type>
      <types>EnumRef.CRM_ВходящееИсходящееСобытие</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.CRM_ВидыСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеСобытия</name>
    <type>
      <types>CatalogRef.CRM_СостоянияСобытий</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеИнтереса</name>
    <comment>Состояние интереса</comment>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьПрисоединенныеФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойИнтерес</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнтересЯвляетсяОснованием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СписокУчастников</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ГлавнаяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>Characteristic.CRM_ОбъектыЖурналаДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CRM_Интерес</name>
    <comment>Интерес</comment>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_СообщенияДиалоговПоследние/CRM_СообщенияДиалоговПоследние.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_СообщенияДиалоговПоследние</name>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </resources>
  <resources>
    <name>ВидСообщения</name>
    <type>
      <types>EnumRef.CRM_ВидыСообщенияМессенджера</types>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСокр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАРМ</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Диалог</name>
    <type>
      <types>CatalogRef.CRM_Диалоги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_ИсторияРеквизитовПартнеров/CRM_ИсторияРеквизитовПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ИсторияРеквизитовПартнеров</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтароеЗначение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭтоНовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ВидЗаписи</name>
    <comment>0 - изменение реквизита объекта, 1 - добавление значения в ТЧ, 2 - удаление значения из ТЧ, 3 - изменение значения в ТЧ.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПутьКДанным</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      <types>String</types>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_ОписаниеРеквизитовМетаданных/CRM_ОписаниеРеквизитовМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ОписаниеРеквизитовМетаданных</name>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/CRM_ТипыСостоянийСобытий/CRM_ТипыСостоянийСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ТипыСостоянийСобытий</name>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/CRM_ВходящееИсходящееСобытие/CRM_ВходящееИсходящееСобытие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВходящееИсходящееСобытие</name>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/CRM_ВидыТочекМаршрута/CRM_ВидыТочекМаршрута.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыТочекМаршрута</name>
  <enumValues>
    <name>Старт</name>
  </enumValues>
  <enumValues>
    <name>Действие</name>
  </enumValues>
  <enumValues>
    <name>Условие</name>
  </enumValues>
  <enumValues>
    <name>ВыборВарианта</name>
  </enumValues>
  <enumValues>
    <name>ВложенныйБизнесПроцесс</name>
  </enumValues>
  <enumValues>
    <name>Разделение</name>
  </enumValues>
  <enumValues>
    <name>Слияние</name>
  </enumValues>
  <enumValues>
    <name>Обработка</name>
  </enumValues>
  <enumValues>
    <name>Завершение</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/СостоянияДокументаСообщениеSMS/СостоянияДокументаСообщениеSMS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияДокументаСообщениеSMS</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
  <enumValues>
    <name>Доставляется</name>
  </enumValues>
  <enumValues>
    <name>Доставлено</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноДоставлено</name>
  </enumValues>
  <enumValues>
    <name>НеДоставлено</name>
  </enumValues>
  <enumValues>
    <name>SMS4B_НеОтправлено</name>
    <comment>Сообщение не удалось отправить на сервер оператору (истек срок жизни sms сообщения)</comment>
  </enumValues>
  <enumValues>
    <name>SMS4B_Отправлено</name>
    <comment>Сообщение отправлено на сервер оператору</comment>
  </enumValues>
  <enumValues>
    <name>SMS4B_Ошибка</name>
    <comment>Сообщение не удалось отправить</comment>
  </enumValues>
  <enumValues>
    <name>SMS4B_Получено</name>
    <comment>Получено входящее сообщение</comment>
  </enumValues>
  <enumValues>
    <name>SMS4B_ПолученоЧастично</name>
    <comment>Получены не все части входящего сообщения</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/SMS4B_ТипыСообщений/SMS4B_ТипыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SMS4B_ТипыСообщений</name>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/CRM_СостоянияСобытий/CRM_СостоянияСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияСобытий</name>
  <predefined>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Завершено</name>
      <description>Завершено</description>
    </items>
    <items>
      <name>Запланировано</name>
      <description>Запланировано</description>
    </items>
    <items>
      <name>Отменено</name>
      <description>Отменено</description>
    </items>
  </predefined>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСостояния</name>
    <type>
      <types>EnumRef.CRM_ТипыСостоянийСобытий</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/CRM_ЛентаСобытийПовтИсп/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ТекстШаблонаЛенты() Экспорт
	
	Возврат Документы.CRM_Интерес.ПолучитьМакет("Лента_Шаблон").ПолучитьТекст();
	
КонецФункции

Функция ТекстЗаглушкиЛенты() Экспорт
	
	Возврат Документы.CRM_Интерес.ПолучитьМакет("Лента_Заглушка").ПолучитьТекст();
	
КонецФункции

Функция ТекстЗапросаДанныхЛенты(Знач ПараметрыЗапроса) Экспорт
	
	ТекстыЗапросаМассив = Новый Массив;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЖурналДокументов.Объект                    КАК Ссылка,
	|	ТИПЗНАЧЕНИЯ(ЖурналДокументов.Объект)       КАК ТипОбъекта,
	|	ЖурналДокументов.Дата                      КАК Дата,
	|	ЖурналДокументов.Номер                     КАК Номер,
	|	ЖурналДокументов.Сумма                     КАК Сумма,
	|	ЖурналДокументов.Валюта                    КАК Валюта,
	|	ЖурналДокументов.Автор                     КАК Автор,
	|	ЖурналДокументов.Проведен                  КАК Проведен,";
	ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	
	Если ПараметрыЗапроса.Режим = "ЛентаИнтереса" Тогда
		ТекстЗапроса = "
		|	""""                                   КАК ТемаИнтереса,
		|	НЕОПРЕДЕЛЕНО                           КАК ТипОбращенияИнтереса,
		|	НЕОПРЕДЕЛЕНО                           КАК Интерес,
		|	ИСТИНА                                 КАК ОсновнойИнтерес,";
	ИначеЕсли ПараметрыЗапроса.Режим = "ЛентаКлиента" Или ПараметрыЗапроса.Режим = "ЛентаКонтакта" Тогда
		ТекстЗапроса = "
		|	ЖурналДокументов.CRM_Интерес.Тема      КАК ТемаИнтереса,
		|	ЖурналДокументов.CRM_Интерес.ТипОбращения      КАК ТипОбращенияИнтереса,
		|	ЖурналДокументов.CRM_Интерес           КАК Интерес,
		|	ЖурналДокументов.ОсновнойИнтерес       КАК ОсновнойИнтерес,";
	КонецЕсли;
	ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = "
	|	ПРЕДСТАВЛЕНИЕ(ЖурналДокументов.ТипОбъекта) КАК Вид
	|ПОМЕСТИТЬ ОбъектыЖурналаОтбор
	|ИЗ
	|	РегистрСведений.CRM_ЖурналДокументов КАК ЖурналДокументов";
	ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	
	Если ПараметрыЗапроса.Режим = "ЛентаИнтереса" Тогда
		ТекстЗапроса = "
		|ГДЕ
		|	ЖурналДокументов.CRM_Интерес = &Объект";
	ИначеЕсли ПараметрыЗапроса.Режим = "ЛентаКлиента" Тогда
		ТекстЗапроса = "
		|ГДЕ
		|	ЖурналДокументов.Клиент = &Объект
		|	И ЖурналДокументов.КонтактноеЛицо В (&ДоступныеКонтакты)";
	ИначеЕсли ПараметрыЗапроса.Режим = "ЛентаКонтакта" Тогда
		ТекстЗапроса = "
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛица
		|		ПО ЖурналДокументов.КонтактноеЛицо = КонтактныеЛица.Ссылка
		|			И ЖурналДокументов.КонтактноеЛицо = &Объект
		|			И ЖурналДокументов.Клиент = КонтактныеЛица.Владелец";
	КонецЕсли;
	ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъектыЖурнала.Ссылка     КАК Ссылка,
	|	ОбъектыЖурнала.ТипОбъекта КАК ТипОбъекта,
	|	ОбъектыЖурнала.Дата       КАК Дата,
	|	ОбъектыЖурнала.Номер      КАК Номер,
	|	ОбъектыЖурнала.Сумма      КАК Сумма,
	|	ОбъектыЖурнала.Валюта     КАК Валюта,
	|	ОбъектыЖурнала.Автор      КАК Автор,
	|	ОбъектыЖурнала.Проведен   КАК Проведен,
	|	ОбъектыЖурнала.Вид        КАК Вид
	|ПОМЕСТИТЬ УникальныеОбъектыЖурнала
	|ИЗ
	|	ОбъектыЖурналаОтбор КАК ОбъектыЖурнала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъектыЖурнала.Ссылка       КАК Ссылка,
	|	ОбъектыЖурнала.ТемаИнтереса КАК ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса КАК ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес      КАК Интерес
	|ПОМЕСТИТЬ ИнтересыПоОбъектам
	|ИЗ
	|	ОбъектыЖурналаОтбор КАК ОбъектыЖурнала
	|ГДЕ
	|	ОбъектыЖурнала.ОсновнойИнтерес
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыЖурнала.Ссылка                              КАК Ссылка,
	|	ОбъектыЖурнала.ТипОбъекта                          КАК ТипОбъекта,
	|	ОбъектыЖурнала.Дата                                КАК Дата,
	|	ОбъектыЖурнала.Номер                               КАК Номер,
	|	ОбъектыЖурнала.Сумма                               КАК Сумма,
	|	ОбъектыЖурнала.Валюта                              КАК Валюта,
	|	ОбъектыЖурнала.Автор                               КАК Автор,
	|	ОбъектыЖурнала.Проведен                            КАК Проведен,
	|	ОбъектыЖурнала.Вид                                 КАК Вид,
	|	ЕСТЬNULL(ИнтересыПоОбъектам.ТемаИнтереса, """")    КАК ТемаИнтереса,
	|	ЕСТЬNULL(ИнтересыПоОбъектам.ТипОбращенияИнтереса, НЕОПРЕДЕЛЕНО)    КАК ТипОбращенияИнтереса,
	|	ЕСТЬNULL(ИнтересыПоОбъектам.Интерес, НЕОПРЕДЕЛЕНО) КАК Интерес
	|ПОМЕСТИТЬ ВсеОбъектыЖурнала
	|ИЗ
	|	УникальныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИнтересыПоОбъектам КАК ИнтересыПоОбъектам
	|		ПО ОбъектыЖурнала.Ссылка = ИнтересыПоОбъектам.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеОбъектыЖурнала.Ссылка       КАК Ссылка,
	|	ВсеОбъектыЖурнала.Дата         КАК Дата,
	|	ВсеОбъектыЖурнала.Номер        КАК Номер,
	|	ВсеОбъектыЖурнала.Сумма        КАК Сумма,
	|	ВсеОбъектыЖурнала.Валюта       КАК Валюта,
	|	ВсеОбъектыЖурнала.Автор        КАК Автор,
	|	ВсеОбъектыЖурнала.Проведен     КАК Проведен,
	|	ВсеОбъектыЖурнала.Вид          КАК Вид,
	|	ВсеОбъектыЖурнала.ТемаИнтереса КАК ТемаИнтереса,
	|	ВсеОбъектыЖурнала.ТипОбращенияИнтереса КАК ТипОбращенияИнтереса,
	|	ВсеОбъектыЖурнала.Интерес      КАК Интерес
	|ПОМЕСТИТЬ ПрочиеОбъектыЖурнала
	|ИЗ
	|	ВсеОбъектыЖурнала КАК ВсеОбъектыЖурнала
	|ГДЕ
	|	ВсеОбъектыЖурнала.ТипОбъекта В(&ПрочиеТипыОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеОбъектыЖурнала.Ссылка       КАК Ссылка,
	|	ВсеОбъектыЖурнала.Дата         КАК Дата,
	|	ВсеОбъектыЖурнала.Номер        КАК Номер,
	|	ВсеОбъектыЖурнала.Сумма        КАК Сумма,
	|	ВсеОбъектыЖурнала.Валюта       КАК Валюта,
	|	ВсеОбъектыЖурнала.Автор        КАК Автор,
	|	ВсеОбъектыЖурнала.Проведен     КАК Проведен,
	|	ВсеОбъектыЖурнала.Вид          КАК Вид,
	|	ВсеОбъектыЖурнала.ТемаИнтереса КАК ТемаИнтереса,
	|	ВсеОбъектыЖурнала.ТипОбращенияИнтереса КАК ТипОбращенияИнтереса,
	|	ВсеОбъектыЖурнала.Интерес      КАК Интерес
	|ПОМЕСТИТЬ ВыбранныеОбъектыЖурнала
	|ИЗ
	|	ВсеОбъектыЖурнала КАК ВсеОбъектыЖурнала
	|ГДЕ
	|	ВсеОбъектыЖурнала.ТипОбъекта В(&ВключенныеТипыОбъектов)
	|	ИЛИ (ВсеОбъектыЖурнала.ТипОбъекта = &ТипИнтерес И ВсеОбъектыЖурнала.ТипОбращенияИнтереса В(&ВключенныеТипыОбращений))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА                                                                КАК ЕстьКоманды,
	|	ЛОЖЬ                                                                  КАК Группировка,
	|	ИСТИНА                                                                КАК ЕстьФайлы,
	|	ОбъектыЖурнала.Ссылка                                                 КАК Ссылка,
	|	Взаимодействие.ПлановаяДата                                           КАК Дата,
	|	ОбъектыЖурнала.Номер                                                  КАК Номер,
	|	Взаимодействие.Тема                                                   КАК Тема,
	|	""ВзаимодействиеПланов""                                              КАК Тип,
	|	Взаимодействие.Ответственный                                          КАК Отправитель,
	|	СтатусыВзаимодействий.ТипСостояния                                    КАК Состояние,
	|	Взаимодействие.КонтактноеЛицо                                         КАК Получатель,
	|	ЛОЖЬ                                                                  КАК Входящий,
	|	РАЗНОСТЬДАТ(Взаимодействие.ПлановаяДатаЗавершение, &ТекущаяДата, ЧАС) КАК Длительность,
	|	НЕОПРЕДЕЛЕНО                                                          КАК УчетнаяЗапись,
	|	0                                                                     КАК Сумма,
	|	НЕОПРЕДЕЛЕНО                                                          КАК Валюта,
	|	Взаимодействие.Результат                                              КАК Результат,
	|	Взаимодействие.ВидВзаимодействия                                      КАК Вид,
	|	ОбъектыЖурнала.ТемаИнтереса                                           КАК ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса                                   КАК ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес                                                КАК Интерес
	|ПОМЕСТИТЬ ДанныеОбъектовПланов
	|ИЗ
	|	Документ.CRM_Взаимодействие КАК Взаимодействие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО Взаимодействие.Ссылка = ОбъектыЖурнала.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияСобытий КАК СтатусыВзаимодействий
	|		ПО Взаимодействие.СтатусВзаимодействия = СтатусыВзаимодействий.Ссылка
	|			И (СтатусыВзаимодействий.ТипСостояния В (ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.Запланировано), ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.ВРаботе)))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_ВидыВзаимодействий КАК ВидыВзаимодействий
	|		ПО Взаимодействие.ВидВзаимодействия = ВидыВзаимодействий.Ссылка
	|			И ВидыВзаимодействий.Направление = ЗНАЧЕНИЕ(Перечисление.CRM_ВходящееИсходящееСобытие.Исходящее)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА                                                                КАК ЕстьКоманды,
	|	ЛОЖЬ                                                                  КАК Группировка,
	|	ИСТИНА                                                                КАК ЕстьФайлы,
	|	ОбъектыЖурнала.Ссылка                                                 КАК Ссылка,
	|	ЗадачаИсполнителя.СрокИсполнения                                      КАК Дата,
	|	ОбъектыЖурнала.Номер                                                  КАК Номер,
	|	ЗадачаИсполнителя.Наименование                                        КАК Тема,
	|	""ЗадачаПланов""                                                      КАК Тип,
	|	ЗадачаИсполнителя.Автор                                               КАК Отправитель,
	|	ЗадачаИсполнителя.ПометкаУдаления                                     КАК Состояние,
	|	ВЫБОР
	|		КОГДА ЗадачаИсполнителя.Исполнитель = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		КОГДА ЗадачаИсполнителя.Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		КОГДА ЗадачаИсполнителя.Исполнитель = ЗНАЧЕНИЕ(Справочник.ВнешниеПользователи.ПустаяСсылка)
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		ИНАЧЕ ЗадачаИсполнителя.Исполнитель
	|	КОНЕЦ                                                                 КАК Получатель,
	|	НЕОПРЕДЕЛЕНО                                                          КАК Входящий,
	|	РАЗНОСТЬДАТ(ЗадачаИсполнителя.СрокИсполнения, &ТекущаяДата, ЧАС)      КАК Длительность,
	|	НЕОПРЕДЕЛЕНО                                                          КАК УчетнаяЗапись,
	|	0                                                                     КАК Сумма,
	|	НЕОПРЕДЕЛЕНО                                                          КАК Валюта,
	|	ЗадачаИсполнителя.РезультатВыполнения                                 КАК Результат,
	|	ЗадачаИсполнителя.CRM_Личная                                          КАК Вид,
	|	ОбъектыЖурнала.ТемаИнтереса                                           КАК ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса                                   КАК ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес                                                КАК Интерес
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ЗадачаИсполнителя.Ссылка = ОбъектыЖурнала.Ссылка
	|			И НЕ( ЗадачаИсполнителя.Выполнена ИЛИ ЗадачаИсполнителя.ПометкаУдаления)
	|			И НЕ (ЗадачаИсполнителя.CRM_ТочкаМаршрута<>Значение(Справочник.CRM_ТочкиМаршрутов.ПустаяСсылка) И ЗадачаИсполнителя.CRM_ТочкаМаршрута.Вид = Значение(Перечисление.CRM_ВидыТочекМаршрута.ВложенныйБизнесПроцесс))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА                                                                КАК ЕстьКоманды,
	|	ЛОЖЬ                                                                  КАК Группировка,
	|	ИСТИНА                                                                КАК ЕстьФайлы,
	|	ОбъектыЖурнала.Ссылка                                                 КАК Ссылка,
	|	ВЫБОР
	|		КОГДА СтатусыВзаимодейтсвий.ТипСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.Завершено)
	|			ТОГДА Взаимодействие.ДатаЗавершенияВзаимодействия
	|		ИНАЧЕ Взаимодействие.ПлановаяДатаЗавершение
	|	КОНЕЦ                                                                 КАК Дата,
	|	ОбъектыЖурнала.Номер                                                  КАК Номер,
	|	Взаимодействие.Тема                                                   КАК Тема,
	|	""ВзаимодействиеИстории""                                             КАК Тип,
	|	Взаимодействие.Ответственный                                          КАК Отправитель,
	|	СтатусыВзаимодейтсвий.ТипСостояния                                    КАК Состояние,
	|	Взаимодействие.КонтактноеЛицо                                         КАК Получатель,
	|	ВЫБОР
	|		КОГДА ВидыВзаимодействий.Направление = ЗНАЧЕНИЕ(Перечисление.CRM_ВходящееИсходящееСобытие.Входящее)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                                                 КАК Входящий,
	|	ВЫБОР
	|		КОГДА СтатусыВзаимодейтсвий.ТипСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.Завершено)
	|			ТОГДА РАЗНОСТЬДАТ(Взаимодействие.ДатаЗавершенияВзаимодействия, Взаимодействие.ПлановаяДатаЗавершение, ЧАС)
	|		ИНАЧЕ РАЗНОСТЬДАТ(Взаимодействие.ПлановаяДатаЗавершение, &ТекущаяДата, ЧАС)
	|	КОНЕЦ                                                                 КАК Длительность,
	|	НЕОПРЕДЕЛЕНО                                                          КАК УчетнаяЗапись,
	|	0                                                                     КАК Сумма,
	|	НЕОПРЕДЕЛЕНО                                                          КАК Валюта,
	|	Взаимодействие.Результат                                              КАК Результат,
	|	Взаимодействие.ВидВзаимодействия                                      КАК Вид,
	|	ОбъектыЖурнала.ТемаИнтереса                                           КАК ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса                                   КАК ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес                                                КАК Интерес
	|ПОМЕСТИТЬ ДанныеОбъектовИстории
	|ИЗ
	|	Документ.CRM_Взаимодействие КАК Взаимодействие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО Взаимодействие.Ссылка = ОбъектыЖурнала.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияСобытий КАК СтатусыВзаимодейтсвий
	|		ПО Взаимодействие.СтатусВзаимодействия = СтатусыВзаимодейтсвий.Ссылка
	|			И (СтатусыВзаимодейтсвий.ТипСостояния В (ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.Завершено), ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.Отменено)))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_ВидыВзаимодействий КАК ВидыВзаимодействий
	|		ПО Взаимодействие.ВидВзаимодействия = ВидыВзаимодействий.Ссылка
	|			И ВидыВзаимодействий.Ссылка В (&ВключенныеВидыВзаимодействий)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА                                                                КАК ЕстьКоманды,
	|	ЛОЖЬ                                                                  КАК Группировка,
	|	ИСТИНА                                                                КАК ЕстьФайлы,
	|	ОбъектыЖурнала.Ссылка                                                 КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ЗадачаИсполнителя.ПометкаУдаления
	|			ТОГДА ЗадачаИсполнителя.СрокИсполнения
	|		ИНАЧЕ ЗадачаИсполнителя.ДатаИсполнения
	|	КОНЕЦ                                                                 КАК Дата,
	|	ОбъектыЖурнала.Номер                                                  КАК Номер,
	|	ЗадачаИсполнителя.Наименование                                        КАК Тема,
	|	""ЗадачаИстории""                                                     КАК Тип,
	|	ЗадачаИсполнителя.Автор                                               КАК Отправитель,
	|	ЗадачаИсполнителя.ПометкаУдаления                                     КАК Состояние,
	|	ВЫБОР
	|		КОГДА ЗадачаИсполнителя.Исполнитель = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		КОГДА ЗадачаИсполнителя.Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		КОГДА ЗадачаИсполнителя.Исполнитель = ЗНАЧЕНИЕ(Справочник.ВнешниеПользователи.ПустаяСсылка)
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		ИНАЧЕ ЗадачаИсполнителя.Исполнитель
	|	КОНЕЦ                                                                 КАК Получатель,
	|	НЕОПРЕДЕЛЕНО                                                          КАК Входящий,
	|	0                                                                     КАК Длительность,
	|	НЕОПРЕДЕЛЕНО                                                          КАК УчетнаяЗапись,
	|	0                                                                     КАК Сумма,
	|	НЕОПРЕДЕЛЕНО                                                          КАК Валюта,
	|	ЗадачаИсполнителя.РезультатВыполнения                                 КАК Результат,
	|	ЗадачаИсполнителя.CRM_Личная                                          КАК Вид,
	|	ОбъектыЖурнала.ТемаИнтереса                                           КАК ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса                                   КАК ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес                                                КАК Интерес
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ЗадачаИсполнителя.Ссылка = ОбъектыЖурнала.Ссылка
	|			И (ЗадачаИсполнителя.Выполнена ИЛИ ЗадачаИсполнителя.ПометкаУдаления)
	|			И НЕ (ЗадачаИсполнителя.CRM_ТочкаМаршрута<>Значение(Справочник.CRM_ТочкиМаршрутов.ПустаяСсылка) И ЗадачаИсполнителя.CRM_ТочкаМаршрута.Вид = Значение(Перечисление.CRM_ВидыТочекМаршрута.ВложенныйБизнесПроцесс))";
	ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	
	Если ПараметрыЗапроса.ВключеныФайлы Тогда
		
		Если ПараметрыЗапроса.Режим = "ЛентаИнтереса" Тогда
			ИмяСправочникаФайлы = "CRM_ИнтересПрисоединенныеФайлы";
		ИначеЕсли ПараметрыЗапроса.Режим = "ЛентаКлиента" Тогда
			ИмяСправочникаФайлы = "ПартнерыПрисоединенныеФайлы";
		ИначеЕсли ПараметрыЗапроса.Режим = "ЛентаКонтакта" Тогда
			ИмяСправочникаФайлы = "КонтактныеЛицаПартнеровПрисоединенныеФайлы";
		КонецЕсли;
		
		ТекстЗапроса = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИСТИНА,
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	ПрисоединенныеФайлы.Ссылка,
		|	ПрисоединенныеФайлы.ДатаСоздания,
		|	"""" КАК Номер,
		|	ПрисоединенныеФайлы.Наименование,
		|	""Файл"",
		|	ПрисоединенныеФайлы.Автор,
		|	ПрисоединенныеФайлы.ПометкаУдаления,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	ПрисоединенныеФайлы.Размер,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	ПрисоединенныеФайлы.Описание,
		|	ПрисоединенныеФайлы.Расширение,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник."+ ИмяСправочникаФайлы +" КАК ПрисоединенныеФайлы
		|ГДЕ
		|	ПрисоединенныеФайлы.ВладелецФайла = &Объект
		|	И НЕ ПрисоединенныеФайлы.ЭтоГруппа";
		ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если ПараметрыЗапроса.ВключеныПримечания Тогда
		ТекстЗапроса = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	Заметка.Ссылка,
		|	Заметка.ДатаИзменения,
		|	"""",
		|	Заметка.ТекстСодержания,
		|	""Примечание"",
		|	Заметка.Автор,
		|	Заметка.ПометкаУдаления,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.Заметки КАК Заметка
		|ГДЕ
		|	Заметка.Предмет = &Объект
		|	И Заметка.CRM_ЗаметкаЛенты";
		ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	ТелефонныйЗвонок.Комментарий,
	|	""ТелефонныйЗвонок"",
	|	ВЫБОР
	|		КОГДА ТелефонныйЗвонок.Входящий
	|			ТОГДА ТелефонныйЗвонок.АбонентПредставление
	|		ИНАЧЕ ТелефонныйЗвонок.Автор
	|	КОНЕЦ,
	|	ТелефонныйЗвонок.сфпСостояниеЗвонка,
	|	ВЫБОР
	|		КОГДА ТелефонныйЗвонок.Входящий
	|			ТОГДА ТелефонныйЗвонок.Ответственный
	|		ИНАЧЕ ТелефонныйЗвонок.АбонентПредставление
	|	КОНЕЦ,
	|	ТелефонныйЗвонок.Входящий,
	|	ТелефонныйЗвонок.сфпДлительностьЗвонка,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ТелефонныйЗвонок.Ссылка = ОбъектыЖурнала.Ссылка
	|ГДЕ
	|	ТелефонныйЗвонок.Входящий В (&ВключенныеНаправленияЗвонков)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	ЭлектронноеПисьмоВходящее.Тема,
	|	""ЭлектронноеПисьмо"",
	|	ЭлектронноеПисьмоВходящее.ОтправительПредставление,
	|	НЕОПРЕДЕЛЕНО,
	|	ЭлектронноеПисьмоВходящее.СписокПолучателейПисьма,
	|	ИСТИНА,
	|	0,
	|	ЭлектронноеПисьмоВходящее.УчетнаяЗапись,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.ЭлектронноеПисьмоВходящее КАК ЭлектронноеПисьмоВходящее
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ЭлектронноеПисьмоВходящее.Ссылка = ОбъектыЖурнала.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ВЫБОР
	|		КОГДА ЭлектронноеПисьмоИсходящее.СтатусПисьма = ЗНАЧЕНИЕ(Перечисление.СтатусыИсходящегоЭлектронногоПисьма.Отправлено)
	|			ТОГДА ЭлектронноеПисьмоИсходящее.ДатаОтправления
	|		ИНАЧЕ ЭлектронноеПисьмоИсходящее.Дата
	|	КОНЕЦ,
	|	ОбъектыЖурнала.Номер,
	|	ЭлектронноеПисьмоИсходящее.Тема,
	|	""ЭлектронноеПисьмо"",
	|	ЭлектронноеПисьмоИсходящее.Автор,
	|	ЭлектронноеПисьмоИсходящее.СтатусПисьма,
	|	ЭлектронноеПисьмоИсходящее.СписокПолучателейПисьма,
	|	ЛОЖЬ,
	|	0,
	|	ЭлектронноеПисьмоИсходящее.УчетнаяЗапись,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ЭлектронноеПисьмоИсходящее.Ссылка = ОбъектыЖурнала.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// +Рарус alexpr
	//|ВЫБРАТЬ
	//|	ИСТИНА,
	//|	ИСТИНА,
	//|	ИСТИНА,
	//|	ОбъектыЖурнала.Ссылка,
	//|	ОбъектыЖурнала.Дата,
	//|	ОбъектыЖурнала.Номер,
	//|	СообщениеМессенджера.ТекстСообщения,
	//|	""СообщениеЧата"",
	//|	ВЫБОР
	//|		КОГДА СообщениеМессенджера.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСообщенияМессенджера.Входящее)
	//|			ТОГДА
	//|				ВЫБОР
	//|					КОГДА СообщениеМессенджера.Контакт В (&ПустыеЗначенияКонтактов)
	//|						ТОГДА СообщениеМессенджера.КонтактПредставление
	//|					ИНАЧЕ СообщениеМессенджера.Контакт
	//|				КОНЕЦ
	//|		ИНАЧЕ СообщениеМессенджера.Ответственный
	//|	КОНЕЦ,
	//|	СообщениеМессенджера.Прочитано,
	//|	ВЫБОР
	//|		КОГДА СообщениеМессенджера.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСообщенияМессенджера.Входящее)
	//|			ТОГДА
	//|				ВЫБОР
	//|					КОГДА СообщениеМессенджера.Ответственный = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	//|						ТОГДА СообщениеМессенджера.CRM_РольОтветственного
	//|					ИНАЧЕ СообщениеМессенджера.Ответственный
	//|				КОНЕЦ
	//|		ИНАЧЕ
	//|				ВЫБОР
	//|					КОГДА СообщениеМессенджера.Контакт В (&ПустыеЗначенияКонтактов)
	//|						ТОГДА СообщениеМессенджера.КонтактПредставление
	//|					ИНАЧЕ СообщениеМессенджера.Контакт
	//|				КОНЕЦ
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА СообщениеМессенджера.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСообщенияМессенджера.Входящее)
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ,
	//|	0,
	//|	СообщениеМессенджера.УчетнаяЗапись,
	//|	0,
	//|	СообщениеМессенджера.Группа,
	//|	СообщениеМессенджера.ID_Пользователя,
	//|	СообщениеМессенджера.КонтактПредставление,
	//|	ОбъектыЖурнала.ТемаИнтереса,
	//|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	//|	ОбъектыЖурнала.Интерес
	//|ИЗ
	//|	Документ.CRM_СообщениеМессенджера КАК СообщениеМессенджера
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	//|		ПО СообщениеМессенджера.Ссылка = ОбъектыЖурнала.Ссылка
	//|ГДЕ
	//|	СообщениеМессенджера.ВидСообщения В (&ВключенныеНаправленияЧатов)
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	CRM_СообщенияДиалоговПоследние.Дата,
	|	CRM_Диалоги.Код,
	|	CRM_СообщенияДиалоговПоследние.ТекстСокр,
	|	""Диалог"",
	|	ВЫБОР
	|		КОГДА CRM_Диалоги.Контакт В (&ПустыеЗначенияКонтактов)
	|			ТОГДА CRM_Диалоги.КонтактПредставление
	|			ИНАЧЕ CRM_Диалоги.Контакт
	|	КОНЕЦ,
	|	Истина,
	|	ВЫБОР
	|		КОГДА CRM_Диалоги.Ответственный = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА CRM_Диалоги.CRM_РольОтветственного
	|			ИНАЧЕ CRM_Диалоги.Ответственный
	|	КОНЕЦ,
	|	ИСТИНА,
	|	0,
	|	CRM_Диалоги.УчетнаяЗапись,
	|	0,
	|	CRM_Диалоги.Группа,
	|	CRM_Диалоги.ID_Пользователя,
	|	CRM_Диалоги.КонтактПредставление,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Справочник.CRM_Диалоги КАК CRM_Диалоги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО CRM_Диалоги.Ссылка = ОбъектыЖурнала.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СообщенияДиалоговПоследние КАК CRM_СообщенияДиалоговПоследние
	|		ПО CRM_СообщенияДиалоговПоследние.Диалог = CRM_Диалоги.Ссылка
	// -Рарус alexpr
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	СообщениеSMS.Тема,
	|	""СообщениеSMS"",
	|	СообщениеSMS.Автор,
	|	ВЫБОР
	|		КОГДА СообщениеSMS.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументаСообщениеSMS.Доставлено)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	СообщениеSMS.СписокУчастников,
	|	ВЫБОР
	|		КОГДА СообщениеSMS.SMS4B_ТипСообщения = ЗНАЧЕНИЕ(Перечисление.SMS4B_ТипыСообщений.Входящее)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.СообщениеSMS КАК СообщениеSMS
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО СообщениеSMS.Ссылка = ОбъектыЖурнала.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	Заявка.Тема,
	|	""Заявка"",
	|	Заявка.Наименование,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ИСТИНА,
	|	0,
	|	Заявка.ИсточникПолучения,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	Заявка.Организация,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.CRM_Заявка КАК Заявка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО Заявка.Ссылка = ОбъектыЖурнала.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	ДокументИнтерес.Тема,
	|	""Интерес"",
	|	ДокументИнтерес.Ответственный,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	ДокументИнтерес.ТипОбращения,
	|	ОбъектыЖурнала.Сумма,
	|	ОбъектыЖурнала.Валюта,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.CRM_Интерес КАК ДокументИнтерес
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ДокументИнтерес.Ссылка = ОбъектыЖурнала.Ссылка";
	ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	
	Если ПараметрыЗапроса.Режим = "ЛентаИнтереса" Тогда
		ТекстЗапроса = "
		|			И ДокументИнтерес.ДокументОснование = &Объект";
		ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	"""",
	|	""КоммерческоеПредложение"",
	|	ОбъектыЖурнала.Автор,
	|	ОбъектыЖурнала.Проведен,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.Сумма,
	|	ОбъектыЖурнала.Валюта,
	|	"""",
	|	ОбъектыЖурнала.Вид,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.КоммерческоеПредложениеКлиенту КАК КоммерческоеПредложение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО КоммерческоеПредложение.Ссылка = ОбъектыЖурнала.Ссылка";
	ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	"""",
	|	""ПрочийДокумент"",
	|	ОбъектыЖурнала.Автор,
	|	ОбъектыЖурнала.Проведен,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.Сумма,
	|	ОбъектыЖурнала.Валюта,
	|	"""",
	|	ОбъектыЖурнала.Вид,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	ПрочиеОбъектыЖурнала КАК ОбъектыЖурнала";
	ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	
	// Записи о создании объекта.
	Если ПараметрыЗапроса.Режим = "ЛентаИнтереса" Тогда
		ТекстЗапроса = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ДокументИнтерес.Ссылка,
		|	ДокументИнтерес.Дата,
		|	ДокументИнтерес.Номер,
		|	ДокументИнтерес.Тема,
		|	""СозданиеОбъекта"",
		|	ДокументИнтерес.Автор,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	ДокументИнтерес.ТипОбращения,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Документ.CRM_Интерес КАК ДокументИнтерес
		|ГДЕ
		|	ДокументИнтерес.Ссылка = &Объект";
	ИначеЕсли ПараметрыЗапроса.Режим = "ЛентаКлиента" Тогда
		ТекстЗапроса = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	Партнеры.Ссылка,
		|	Партнеры.ДатаРегистрации,
		|	"""",
		|	Партнеры.Наименование,
		|	""СозданиеОбъекта"",
		|	Партнеры.CRM_Автор,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.Партнеры КАК Партнеры
		|ГДЕ
		|	Партнеры.Ссылка = &Объект";
	Иначе
		ТекстЗапроса = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	Контакты.Ссылка,
		|	Контакты.ДатаРегистрацииСвязи,
		|	"""",
		|	Контакты.Наименование,
		|	""СозданиеОбъекта"",
		|	Контакты.Автор,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров КАК Контакты
		|ГДЕ
		|	Контакты.Ссылка = &Объект";
	КонецЕсли;
	ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	
	Если ПараметрыЗапроса.ВключеноИзменениеСостояния И ПараметрыЗапроса.Режим = "ЛентаИнтереса" Тогда
		
		// История изменений состояния.
		ТекстЗапроса = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЗаписиИстории.Партнер,
		|	ЗаписиИстории.Период,
		|	"""",
		|	"""",
		|	""ЗаписьИстории"",
		|	ЗаписиИстории.СтароеЗначение,
		|	ЗаписиИстории.ЭтоНовый,
		|	ЗаписиИстории.Значение,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	ЗаписиИстории.Автор,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	ЕСТЬNULL(ОписаниеРеквизитов.Представление, ЗаписиИстории.ПутьКДанным),
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	РегистрСведений.CRM_ИсторияРеквизитовПартнеров КАК ЗаписиИстории
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОписаниеРеквизитовМетаданных КАК ОписаниеРеквизитов
		|		ПО ЗаписиИстории.ПутьКДанным = ОписаниеРеквизитов.Реквизит
		|			И ОписаниеРеквизитов.Объект = ""Документ.CRM_Интерес""";
		ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
		
		ТекстЗапроса = "
		|ГДЕ
		|	ЗаписиИстории.Партнер = &Объект
		|		И НЕ ЗаписиИстории.ЭтоНовый
		|		И ЗаписиИстории.ПутьКДанным = ""СостояниеИнтереса""";
		ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если ПараметрыЗапроса.ВключеноИзменениеОтветственного
		И (ПараметрыЗапроса.Режим = "ЛентаИнтереса" Или ПараметрыЗапроса.Режим = "ЛентаКлиента") Тогда
		
		// История изменений ответственного.
		ТекстЗапроса = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЗаписиИстории.Партнер,
		|	ЗаписиИстории.Период,
		|	"""",
		|	"""",
		|	""ЗаписьИстории"",
		|	ЗаписиИстории.СтароеЗначение,
		|	ЗаписиИстории.ЭтоНовый,
		|	ЗаписиИстории.Значение,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	ЗаписиИстории.Автор,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	ЕСТЬNULL(ОписаниеРеквизитов.Представление, ЗаписиИстории.ПутьКДанным),
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	РегистрСведений.CRM_ИсторияРеквизитовПартнеров КАК ЗаписиИстории
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОписаниеРеквизитовМетаданных КАК ОписаниеРеквизитов
		|		ПО ЗаписиИстории.ПутьКДанным = ОписаниеРеквизитов.Реквизит";
		ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
		
		Если ПараметрыЗапроса.Режим = "ЛентаИнтереса" Тогда
			ТекстЗапроса = "
			|			И ОписаниеРеквизитов.Объект = ""Документ.CRM_Интерес""
			|ГДЕ
			|	ЗаписиИстории.Партнер = &Объект
			|		И НЕ ЗаписиИстории.ЭтоНовый
			|		И ЗаписиИстории.ПутьКДанным = ""Ответственный""";
		ИначеЕсли ПараметрыЗапроса.Режим = "ЛентаКлиента" Тогда
			ТекстЗапроса = "
			|			И ОписаниеРеквизитов.Объект = ""Справочник.Партнеры""
			|ГДЕ
			|	ЗаписиИстории.Партнер = &Объект
			|		И НЕ ЗаписиИстории.ЭтоНовый
			|		И ЗаписиИстории.ПутьКДанным = ""ОсновнойМенеджер""";
		КонецЕсли;
		ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если ПараметрыЗапроса.ВключенаИстория Тогда
		
		Если ПараметрыЗапроса.Режим = "ЛентаИнтереса" Тогда
			
			// Запись о завершении интереса.
			ТекстЗапроса = "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЛОЖЬ,
			|	ЛОЖЬ,
			|	ЛОЖЬ,
			|	ДокументИнтерес.Ссылка,
			|	ДокументИнтерес.ДатаЗакрытия,
			|	ДокументИнтерес.Номер,
			|	ДокументИнтерес.Тема,
			|	""ЗавершениеИнтереса"",
			|	ДокументИнтерес.Ответственный,
			|	ВЫБОР
			|		КОГДА ДокументИнтерес.ПричинаОтказа = ЗНАЧЕНИЕ(Справочник.CRM_ПричиныОтказаПоИнтересам.ПустаяСсылка)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО,
			|	0,
			|	ДокументИнтерес.ТипОбращения,
			|	0,
			|	НЕОПРЕДЕЛЕНО,
			|	"""",
			|	НЕОПРЕДЕЛЕНО,
			|	"""",
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО
			|ИЗ
			|	Документ.CRM_Интерес КАК ДокументИнтерес
			|ГДЕ
			|	ДокументИнтерес.Ссылка = &Объект
			|	И ДокументИнтерес.Завершен";
			ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
			
		КонецЕсли;
		
		// История изменения реквизитов.
		ТекстЗапроса = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЗаписиИстории.Партнер,
		|	ЗаписиИстории.Период,
		|	"""",
		|	"""",
		|	""ЗаписьИстории"",
		|	ЗаписиИстории.СтароеЗначение,
		|	ЗаписиИстории.ЭтоНовый,
		|	ЗаписиИстории.Значение,
		|	НЕОПРЕДЕЛЕНО,
		|	ЗаписиИстории.ВидЗаписи,
		|	ЗаписиИстории.Автор,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	ЕСТЬNULL(ОписаниеРеквизитов.Представление, ЗаписиИстории.ПутьКДанным),
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	РегистрСведений.CRM_ИсторияРеквизитовПартнеров КАК ЗаписиИстории
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОписаниеРеквизитовМетаданных КАК ОписаниеРеквизитов
		|		ПО ЗаписиИстории.ПутьКДанным = ОписаниеРеквизитов.Реквизит";
		ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
		
		Если ПараметрыЗапроса.Режим = "ЛентаИнтереса" Тогда
			ТекстЗапроса = "
			|			И ОписаниеРеквизитов.Объект = ""Документ.CRM_Интерес""";
		ИначеЕсли ПараметрыЗапроса.Режим = "ЛентаКлиента" Тогда
			ТекстЗапроса = "
			|			И ОписаниеРеквизитов.Объект = ""Справочник.Партнеры""";
		ИначеЕсли ПараметрыЗапроса.Режим = "ЛентаКонтакта" Тогда
			ТекстЗапроса = "
			|			И ОписаниеРеквизитов.Объект = ""Справочник.КонтактныеЛицаПартнеров""";
		КонецЕсли;
		ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
		
		ТекстЗапроса = "
		|ГДЕ
		|	ЗаписиИстории.Партнер = &Объект
		|		И НЕ ЗаписиИстории.ЭтоНовый
		|		И НЕ ЗаписиИстории.ПутьКДанным В (""СостояниеИнтереса"", ""Ответственный"", ""ОсновнойМенеджер"")";
		ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	// Финальная выборка с количеством объектов.
	ТекстЗапроса = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ" + ?(ПараметрыЗапроса.ОбъектовИстории > 0, " ПЕРВЫЕ " + СтрЗаменить(ПараметрыЗапроса.ОбъектовИстории, Символы.НПП, ""), "") + "
	|	ДанныеОбъектов.ЕстьКоманды               КАК ЕстьКоманды,
	|	ДанныеОбъектов.ЕстьФайлы                 КАК ЕстьФайлы,
	|	ДанныеОбъектов.Группировка               КАК Группировка,
	|	ДанныеОбъектов.Тип                       КАК Тип,
	|	ДанныеОбъектов.Дата                      КАК Дата,
	|	ДанныеОбъектов.Номер                     КАК Номер,
	|	ДанныеОбъектов.Входящий                  КАК Входящий,
	|	ДанныеОбъектов.Отправитель               КАК Отправитель,
	|	ДанныеОбъектов.Получатель                КАК Получатель,
	|	ДанныеОбъектов.Состояние                 КАК Состояние,
	|	ДанныеОбъектов.Длительность              КАК Длительность,
	|	ДанныеОбъектов.Тема                      КАК Тема,
	|	ДанныеОбъектов.Ссылка                    КАК Ссылка,
	|	ДанныеОбъектов.УчетнаяЗапись             КАК УчетнаяЗапись,
	|	ДанныеОбъектов.Сумма                     КАК Сумма,
	|	ДанныеОбъектов.Валюта                    КАК Валюта,
	|	ДанныеОбъектов.Результат                 КАК Результат,
	|	ДанныеОбъектов.Вид                       КАК Вид,
	|	ДанныеОбъектов.ТемаИнтереса              КАК ТемаИнтереса,
	|	ДанныеОбъектов.ТипОбращенияИнтереса      КАК ТипОбращенияИнтереса,
	|	ДанныеОбъектов.Интерес                   КАК Интерес
	|ПОМЕСТИТЬ ДанныеОбъектовИсторииСортировка
	|ИЗ
	|	ДанныеОбъектовИстории КАК ДанныеОбъектов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ,
	|	Тип
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ДанныеОбъектов.Ссылка) КАК Количество
	|ИЗ
	|	ДанныеОбъектовИстории КАК ДанныеОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0                                        КАК Раздел,
	|	ДанныеОбъектов.ЕстьКоманды               КАК ЕстьКоманды,
	|	ДанныеОбъектов.ЕстьФайлы                 КАК ЕстьФайлы,
	|	ДанныеОбъектов.Группировка               КАК Группировка,
	|	ДанныеОбъектов.Тип                       КАК Тип,
	|	ДанныеОбъектов.Дата                      КАК Дата,
	|	ДанныеОбъектов.Номер                     КАК Номер,
	|	НАЧАЛОПЕРИОДА(ДанныеОбъектов.Дата, ДЕНЬ) КАК ДатаБезВремени,
	|	ГОД(ДанныеОбъектов.Дата)                 КАК Год,
	|	ДанныеОбъектов.Входящий                  КАК Входящий,
	|	ДанныеОбъектов.Отправитель               КАК Отправитель,
	|	ДанныеОбъектов.Получатель                КАК Получатель,
	|	ДанныеОбъектов.Состояние                 КАК Состояние,
	|	ДанныеОбъектов.Длительность              КАК Длительность,
	|	ДанныеОбъектов.Тема                      КАК Тема,
	|	ДанныеОбъектов.Ссылка                    КАК Ссылка,
	|	ДанныеОбъектов.УчетнаяЗапись             КАК УчетнаяЗапись,
	|	ДанныеОбъектов.Сумма                     КАК Сумма,
	|	ДанныеОбъектов.Валюта                    КАК Валюта,
	|	ДанныеОбъектов.Результат                 КАК Результат,
	|	ДанныеОбъектов.Вид                       КАК Вид,
	|	ДанныеОбъектов.ТемаИнтереса              КАК ТемаИнтереса,
	|	ДанныеОбъектов.ТипОбращенияИнтереса      КАК ТипОбращенияИнтереса,
	|	ДанныеОбъектов.Интерес                   КАК Интерес
	|ИЗ
	|	ДанныеОбъектовПланов КАК ДанныеОбъектов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1                                        КАК Раздел,
	|	ДанныеОбъектов.ЕстьКоманды               КАК ЕстьКоманды,
	|	ДанныеОбъектов.ЕстьФайлы                 КАК ЕстьФайлы,
	|	ДанныеОбъектов.Группировка               КАК Группировка,
	|	ДанныеОбъектов.Тип                       КАК Тип,
	|	ДанныеОбъектов.Дата                      КАК Дата,
	|	ДанныеОбъектов.Номер                     КАК Номер,
	|	НАЧАЛОПЕРИОДА(ДанныеОбъектов.Дата, ДЕНЬ) КАК ДатаБезВремени,
	|	ГОД(ДанныеОбъектов.Дата)                 КАК Год,
	|	ДанныеОбъектов.Входящий                  КАК Входящий,
	|	ДанныеОбъектов.Отправитель               КАК Отправитель,
	|	ДанныеОбъектов.Получатель                КАК Получатель,
	|	ДанныеОбъектов.Состояние                 КАК Состояние,
	|	ДанныеОбъектов.Длительность              КАК Длительность,
	|	ДанныеОбъектов.Тема                      КАК Тема,
	|	ДанныеОбъектов.Ссылка                    КАК Ссылка,
	|	ДанныеОбъектов.УчетнаяЗапись             КАК УчетнаяЗапись,
	|	ДанныеОбъектов.Сумма                     КАК Сумма,
	|	ДанныеОбъектов.Валюта                    КАК Валюта,
	|	ДанныеОбъектов.Результат                 КАК Результат,
	|	ДанныеОбъектов.Вид                       КАК Вид,
	|	ДанныеОбъектов.ТемаИнтереса              КАК ТемаИнтереса,
	|	ДанныеОбъектов.ТипОбращенияИнтереса      КАК ТипОбращенияИнтереса,
	|	ДанныеОбъектов.Интерес                   КАК Интерес
	|ИЗ
	|	ДанныеОбъектовИсторииСортировка КАК ДанныеОбъектов
	|УПОРЯДОЧИТЬ ПО
	|	Раздел,
	|	Дата УБЫВ,
	|	Тип";
	ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	
	Возврат СтрСоединить(ТекстыЗапросаМассив);
	
КонецФункции

Функция ОтборыОбъектовЛенты(Знач НастройкиЛенты) Экспорт
	
	ОтборЛенты = Новый СписокЗначений;
	
	ОтборЛенты.Добавить("ВсеСобытия",		НСтр("ru='Все события';en='All events'"),				Истина);
	//ОтборЛенты.Добавить("Взаимодействия",	НСтр("ru='Завершенные взаимодействия';en='Finished Interactions'"),		Истина);
	
	ОтборЛенты.Добавить("Задачи",			НСтр("ru='Завершенные задачи';en='Finished Tasks'"),	Истина);
	
	ОтборЛенты.Добавить("ВзаимодействияВстречи",	НСтр("ru = 'Завершенные встречи'"),				Истина);
	
	ОтборЛенты.Добавить("Звонки",			НСтр("ru='Звонки';en='Phone Calls'"),					Истина);
	ОтборЛенты.Добавить("ВходящиеЗвонки",	НСтр("ru = 'Входящие'"),								Истина);
	ОтборЛенты.Добавить("ИсходящиеЗвонки",	НСтр("ru = 'Исходящие'"),								Истина);
	
	ОтборЛенты.Добавить("Письма",			НСтр("ru='Письма';en='Letters'"),						Истина);
	ОтборЛенты.Добавить("ВходящиеПисьма",	НСтр("ru = 'Входящие'"),								Истина);
	ОтборЛенты.Добавить("ИсходящиеПисьма",	НСтр("ru = 'Исходящие'"),								Истина);
	
	ОтборЛенты.Добавить("ВзаимодействияПрочие",	НСтр("ru = 'Прочие взаимодействия'"),				Истина);
	
	Если НастройкиЛенты.ИспользоватьЧаты Тогда
		ОтборЛенты.Добавить("Чаты",				НСтр("ru='Чаты';en='Chats'"),						Истина);
		ОтборЛенты.Добавить("ВходящиеЧаты",		НСтр("ru = 'Входящие'"),							Истина);
		ОтборЛенты.Добавить("ИсходящиеЧаты",	НСтр("ru = 'Исходящие'"),							Истина);
	КонецЕсли;
	
	ОтборЛенты.Добавить("SMS",				НСтр("ru='SMS';en='SMS'"),								Истина);
	
	Если НастройкиЛенты.Режим = "ЛентаИнтереса" Тогда
		ОтборЛенты.Добавить("ИзменениеСостояния",	НСтр("ru='Изменено состояние';en='Changed State'"), Истина);
	КонецЕсли;
	Если НастройкиЛенты.Режим = "ЛентаИнтереса" Или НастройкиЛенты.Режим = "ЛентаКлиента" Тогда
		ОтборЛенты.Добавить("ИзменениеОтветственного",	НСтр("ru='Смена ответственного';en='Reponsible Person Replacement'"), Истина);
	КонецЕсли;
	
	ОтборЛенты.Добавить("История",			НСтр("ru='Изменение поля';en='Changing field'"),		Истина);
	ОтборЛенты.Добавить("Примечания",		НСтр("ru='Примечания';en='Comments'"),					Истина);
	ОтборЛенты.Добавить("Документы",		НСтр("ru='Документы';en='Documents'"),					Истина);
	
	Если НастройкиЛенты.Режим = "ЛентаКлиента" Или НастройкиЛенты.Режим = "ЛентаКонтакта" Тогда
		ОтборЛенты.Добавить("Интересы",			НСтр("ru='Интересы';en='Leads'"),					Истина);
		ОтборЛенты.Добавить("ИнтересыКакПоддержка",			НСтр("ru = 'Обращения в поддержку'"),	Истина);
	КонецЕсли;
	
	ОтборЛенты.Добавить("Файлы",			НСтр("ru = 'Файлы'"),									Истина);
	
	Возврат ОтборЛенты;
	
КонецФункции

Функция ТипыОбъектовОтбораДокументов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипыОбъектов = Новый Массив;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОбъектыЖурналаДокументов.ТипЗначения КАК ТипЗначения
	|ИЗ
	|	ПланВидовХарактеристик.CRM_ОбъектыЖурналаДокументов КАК ОбъектыЖурналаДокументов");
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ТипыОбъектов;
	КонецЕсли;
	
	ТипБизнесПроцесс = Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс");
	Если Метаданные.Документы.Найти("CRM_ДокументРасчетовСКонтрагентом")<>Неопределено Тогда
		ТипДокументРасчетов = ТипЗнч(ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.CRM_ДокументРасчетовСКонтрагентом").ЗначениеПустойСсылки);
	Иначе
		ТипДокументРасчетов = Неопределено;
	КонецЕсли;
	
	ОсновныеОбъекты = Новый Массив;
	ОсновныеОбъекты.Добавить(Тип("СправочникСсылка.Заметки"));
	ОсновныеОбъекты.Добавить(Тип("ДокументСсылка.CRM_Взаимодействие"));
	ОсновныеОбъекты.Добавить(Тип("ЗадачаСсылка.ЗадачаИсполнителя"));
	ОсновныеОбъекты.Добавить(Тип("ДокументСсылка.ТелефонныйЗвонок"));
	ОсновныеОбъекты.Добавить(Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее"));
	ОсновныеОбъекты.Добавить(Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее"));
	ОсновныеОбъекты.Добавить(Тип("ДокументСсылка.CRM_СообщениеМессенджера"));
	ОсновныеОбъекты.Добавить(Тип("ДокументСсылка.СообщениеSMS"));
	ОсновныеОбъекты.Добавить(Тип("ДокументСсылка.CRM_Заявка"));
	ОсновныеОбъекты.Добавить(Тип("ДокументСсылка.CRM_Интерес"));
	ОсновныеОбъекты.Добавить(Тип("ДокументСсылка.КоммерческоеПредложениеКлиенту"));
	// +Рарус alexpr
	ОсновныеОбъекты.Добавить(Тип("СправочникСсылка.CRM_Диалоги"));
	// -Рарус alexpr
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ТипыВыборки = Выборка.ТипЗначения.Типы();
		Для Каждого ТипОбъекта Из ТипыВыборки Цикл
			Если ТипОбъекта = ТипБизнесПроцесс Тогда
				Продолжить; // Исключить из ленты бизнес-процессы.
			КонецЕсли;
			Если ТипОбъекта = ТипДокументРасчетов Тогда
				Продолжить; // Исключить из ленты документы расчетов.
			КонецЕсли;
			Если ОсновныеОбъекты.Найти(ТипОбъекта) = Неопределено Тогда
				ИмяОбъекта = Метаданные.НайтиПоТипу(ТипОбъекта).ПолноеИмя();
				Если ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(ИмяОбъекта) Тогда
					ТипыОбъектов.Добавить(ТипОбъекта);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТипыОбъектов;
	
КонецФункции

Функция ПустыеЗначенияКонтактовВзаимодействий() Экспорт
	
	ПустыеЗначения = Новый Массив;
	
	ТипыКонтактов = Метаданные.ОпределяемыеТипы.КонтактВзаимодействия.Тип.Типы();
	Для Каждого Тип Из ТипыКонтактов Цикл
		ИмяОбъекта = Метаданные.НайтиПоТипу(Тип).ПолноеИмя();
		ПустыеЗначения.Добавить(ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяОбъекта).ПустаяСсылка());
	КонецЦикла;
	ПустыеЗначения.Добавить(Неопределено);
	
	Возврат ПустыеЗначения;
	
КонецФункции

#КонецОбласти
